# Zone Volume Property

Source: https://www.revitapidocs.com/2026/9a86a1f5-1991-caad-7262-af88ee564e0d.htm

---

| Zone Volume Property |
| --- |

**Note: This API is now obsolete.**

Get the Volume of the Zone.
**Namespace:** Autodesk.Revit.DB.Mechanical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object and their properties instead.")]
public double Volume { get; }
```

```
<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object and their properties instead.")>
Public ReadOnly Property Volume As Double
	Get
```

```
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object and their properties instead.")]
property double Volume {
	double get ();
}
```

```
[<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object and their properties instead.")>]
member Volume : float with get
```

#### Property Value

Double Remarks This property is used to get the Volume of the Zone. See Also

#### Reference

Zone Class Autodesk.Revit.DB.Mechanical Namespace